Repository: cuongccna/NKtrading2
Catalog: nktrading_app/lib/l10n/app_*.arb
Languages: vi

source: Login
vi: Đăng Nhập

source: Register
vi: Đăng Ký

source: Welcome Back!
vi: Chào mừng trở lại!

source: Password
vi: Mật khẩu

# noAccount
source: Don't have an account?
vi: Chưa có tài khoản?

source: Register now
vi: Đăng ký ngay

source: Trading Journal
vi: Nhật Ký Giao Dịch

source: Logout
vi: Đăng xuất

source: Add Trade
vi: Thêm Giao Dịch

# symbol
source: Symbol (e.g., BTC/USDT)
vi: Cặp giao dịch (VD: BTC/USDT)

source: Direction
vi: Vị thế

source: Long
vi: Mua (Long)

source: Short
vi: Bán (Short)

source: Entry Price
vi: Giá vào lệnh

# exitPrice
source: Exit Price (Optional)
vi: Giá thoát lệnh (Không bắt buộc)

source: Quantity
vi: Số lượng

# strategy
source: Strategy (e.g., Breakout)
vi: Chiến lược (VD: Breakout)

# notes
source: Notes / Reflections
vi: Ghi chú / Phân tích

source: Psychology
vi: Yếu tố tâm lý

# mindsetRating
source: Mindset (1-5)
vi: Tâm lý (1-5 sao)

# emotionTags
source: Emotion Tags (e.g., FOMO, Patient)
vi: Thẻ cảm xúc (VD: FOMO, Kiên nhẫn)

source: Save Trade
vi: Lưu Giao Dịch

# viewImage
source: View Full Image
vi: Xem Ảnh Lớn

source: Dashboard
vi: Bảng điều khiển

source: Journal
vi: Nhật ký

source: Details
vi: Chi tiết

# symbolLabel
source: Symbol
vi: Cặp Giao Dịch

# directionLabel
source: Direction
vi: Vị thế

# entryPriceLabel
source: Entry Price
vi: Giá vào lệnh

# exitPriceLabel
source: Exit Price
vi: Giá thoát lệnh

source: Not Closed
vi: Chưa đóng

# quantityLabel
source: Quantity
vi: Số lượng

# strategyLabel
source: Strategy
vi: Chiến lược

# notesLabel
source: Notes
vi: Ghi chú

# psychologyLabel
source: Psychology
vi: Tâm lý

# mindsetRatingLabel
source: Mindset (1-5)
vi: Tâm lý (1-5)

# emotionTagsLabel
source: Emotion Tags
vi: Thẻ cảm xúc

# noValue
source: None
vi: Không có

source: Chart
vi: Biểu đồ

source: Chart Screenshot
vi: Ảnh chụp biểu đồ

source: Filter Trades
vi: Lọc Giao Dịch

source: Date Range
vi: Khoảng Thời Gian

source: Select Date
vi: Chọn ngày

source: All
vi: Tất cả

source: Apply
vi: Áp dụng

source: Reset
vi: Đặt lại

source: Connections
vi: Kết nối

source: Manage API Keys
vi: Quản lý API Key

source: Add Connection
vi: Thêm Kết Nối

# noConnections
source: You have not added any API connections yet.
vi: Bạn chưa thêm kết nối API nào.

source: Add API Key
vi: Thêm API Key

source: Exchange
vi: Sàn giao dịch

# label
source: Label (e.g., Main Account)
vi: Tên gọi (VD: Tài khoản chính)

source: Important Notice
vi: Lưu ý Quan trọng

# readOnlyWarning
source: For your security, please ensure the API key is set to 'Read-only' and does not have trading or withdrawal permissions.
vi: Vì lý do bảo mật, vui lòng đảm bảo API key được tạo ở chế độ 'Chỉ Đọc' và không có quyền Giao dịch hay Rút tiền.

# iUnderstand
source: I have read and understand
vi: Tôi đã đọc và hiểu

source: Save
vi: Lưu

source: Sync
vi: Đồng bộ

source: Syncing...
vi: Đang đồng bộ...

source: API Keys
vi: API Sàn

source: Wallets
vi: Địa chỉ Ví

source: Add Wallet
vi: Thêm Ví

source: Wallet Address
vi: Địa chỉ Ví

source: Blockchain
vi: Mạng lưới

# noWallets
source: You have not added any wallets yet.
vi: Bạn chưa thêm địa chỉ ví nào.

source: Sync Wallet
vi: Đồng bộ Ví

source: Search by symbol...
vi: Tìm theo cặp giao dịch...

source: Top 10 Winning Trades
vi: Top 10 Giao dịch Lãi nhất

source: Top 10 Losing Trades
vi: Top 10 Giao dịch Lỗ nhất

source: AI Insights
vi: Phân tích AI

source: Best Performing Strategy
vi: Chiến lược Hiệu quả nhất

source: Best Performing Day
vi: Ngày Giao dịch Tốt nhất

# bestPerformingSession
source: Best Trading Session
vi: Phiên Giao dịch Tốt nhất

source: PnL
vi: Lãi/Lỗ

source: Winrate
vi: Tỷ lệ thắng

source: Trade Count
vi: Số lệnh

source: Psychological Analysis
vi: Phân tích Tâm lý

source: Performance by Mindset
vi: Hiệu suất theo Điểm tâm lý

source: Performance by Emotion
vi: Hiệu suất theo Thẻ cảm xúc

source: Rating
vi: Điểm

source: Tag
vi: Thẻ

source: Average PnL
vi: Lãi/Lỗ Trung bình
